Podkova/src/Enums/СтороныУчастникиСервисаEDI/СтороныУчастникиСервисаEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтороныУчастникиСервисаEDI</name>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/СтороныУчастникиСервисаEDI/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСТаблицейСоответствия

Функция ЗначениеПоИдентификаторуКлиентскогоAPI(Идентификатор) Экспорт 
	
	ТаблицаСоответствий = ТаблицаУчастниковСервисаКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюСервиса(ТаблицаСоответствий, Идентификатор);
	
КонецФункции

Функция ИдентификаторКлиентскогоAPIПоЗначению(Значение) Экспорт 
	
	ТаблицаСоответствий = ТаблицаУчастниковСервисаКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюИБ(ТаблицаСоответствий, Значение);
	
КонецФункции

#КонецОбласти

#Область РаботаСТаблицейСоответствия

Функция ТаблицаУчастниковСервисаКлиентскогоAPI()
	
	Результат = ТаблицаСоответствийЗначений();
	
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтороныУчастникиСервисаEDI.ПустаяСсылка(), "");
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтороныУчастникиСервисаEDI.Покупатель, "customer");
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтороныУчастникиСервисаEDI.Поставщик,  "supplier");
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуСоответствия(СоответствиеЗначений, ЗначениеИБ, ЗначениеСервиса)
	
	НоваяСтрока = СоответствиеЗначений.Добавить();
	
	НоваяСтрока.ЗначениеСервиса = ЗначениеСервиса;
	НоваяСтрока.ЗначениеИБ = ЗначениеИБ;
	
КонецПроцедуры

Функция ТаблицаСоответствийЗначений()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ЗначениеСервиса");
	Результат.Колонки.Добавить("ЗначениеИБ");
	
	Возврат Результат ;
	
КонецФункции

Функция СоответствиеПоЗначениюСервиса(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеСервиса");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеИБ;
	КонецЕсли;
	
КонецФункции

Функция СоответствиеПоЗначениюИБ(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеИБ");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеСервиса;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
